{
  "id": "NeurIPS.cc_2024_Conference",
  "name": "Conference on Neural Information Processing Systems of 2024",
  "type": "Conference on Neural Information Processing Systems",
  "description": "The Conference on Neural Information Processing Systems (NeurIPS) is one of the most prestigious conferences in machine learning, artificial intelligence (AI), and computational neuroscience. It covers a broad range of topics, including deep learning, reinforcement learning, probabilistic methods, optimization, and AI ethics. NeurIPS attracts top researchers from academia and industry, fostering innovation and interdisciplinary collaboration.",
  "guidelines": "### Write thoughtful reviews:\n\n    * We know that serving as a reviewer for NeurIPS is time consuming, but the community depends on your high quality reviews to uphold the scientific quality of NeurIPS. \n    * Please make your review as informative and substantiated as possible; superficial, uninformed reviews are worse than no review as they may contribute noise to the review process.\n    * You can see the review form questions and guidance on how to answer each question in the 'Review Form' below.\n    * In general, authors should be rewarded rather than punished for being up front about the limitations of their work and any potential negative societal impact. You are encouraged to think through whether any critical points are missing and provide these as feedback for the authors.\n    * Do not worry about minor violations of the required format (e.g., papers that exceed the page limit by a few lines), but immediately report any major violations that you notice to your AC.\n    * When writing your review, please keep in mind that after decisions have been made, reviews and meta-reviews of accepted papers as well as your discussion with the authors will be made public (but reviewer and SAC/AC identities will remain anonymous). \n    * Please note that the review form this year asks for some additional fields such as text fields for the strengths and weaknesses, and questions and suggestions for authors. There are also additional ratings on soundness, presentation and contribution, in addition to the overall rating. These are intended to make it easier for the AC and SAC to understand your rationale for the rating, and facilitate better discussions.",
   "guidelines_detailed": "### Checklist\n 1. Claims\nAssess whether the main claims in the abstract and introduction accurately reflect the paper's contributions and scope. Ensure that claims align with theoretical and experimental results in terms of generalizability. Contributions, assumptions, and limitations should be clearly stated. Aspirational goals can be included as motivation but should be distinguished from actual contributions.\n\n 2. Limitations\nEvaluate whether the paper discusses its limitations explicitly. Consider if strong assumptions are identified and their robustness is addressed (e.g., independence assumptions, model well-specification, asymptotic approximations). Reflect on how these assumptions might be violated in practice and their implications. Assess whether empirical results depend on implicit assumptions that are clearly articulated. \n\n 3. Theory, Assumptions, and Proofs\nIf the paper includes theoretical results, verify that all assumptions are clearly stated or referenced. Ensure that proofs are complete and either included in the main paper or supplemental materials. Informal proofs in the main text should be complemented by formal proofs in the appendix. Theorems and lemmas should be properly referenced, and the relationship to related literature should be discussed.\n\n 4. Experimental Result Reproducibility\nIf the paper presents a dataset or model, assess whether it provides sufficient details to allow others to verify or reproduce results. Depending on the contribution, this may involve full architecture descriptions, replication instructions, model access, or model checkpoints. Consider whether the approach to reproducibility is appropriate given the research's nature.\n\n 5. Open Access to Data and Code\nFor experimental results, determine whether the paper includes the code, data, and instructions necessary for reproduction. Check if main experimental results, including baselines, are reproducible and whether instructions provide exact commands and environment details. Consider whether the lack of code/data is justifiable (e.g., proprietary constraints) and if an anonymized version is provided.\n\n 6. Experimental Setting/Details\nFor empirical studies, verify that the paper specifies training details such as data splits, hyperparameters, and their selection process. Important details should be in the main paper, while full details may be in the appendix or supplement. The experimental setup should be described sufficiently to allow proper interpretation of results.\n\n 7. Experiment Statistical Significance\nCheck if error bars, confidence intervals, or statistical significance tests are reported for key experimental results. The factors contributing to variability (e.g., train/test split, initialization) should be clearly stated, along with the method used to compute error bars. Assumptions underlying statistical tests should be specified, and graphical or tabular representations should avoid misleading depictions of uncertainty.\n\n 8. Compute Resources\nReview whether the paper provides sufficient information on computational resources used for experiments, including hardware type (CPU/GPU, cloud provider), memory, and execution time. Consider whether total compute usage, including failed or preliminary experiments, is disclosed.\n\n 9. Code of Ethics\nEnsure the research aligns with the NeurIPS Code of Ethics. If any deviations are necessary, they should be explained while preserving anonymity.\n\n 10. Broader Impacts\nIf relevant, consider whether the paper discusses potential negative societal impacts. These could include issues related to fairness, privacy, security, and potential misuse. Evaluate whether mitigation strategies are proposed where appropriate. If foundational research is not tied to applications, an impact discussion may not be necessary.\n\n 11. Safeguards\nFor high-risk models (e.g., pretrained language models), assess whether safeguards are in place to prevent misuse. Consider whether access restrictions, usage guidelines, or other control mechanisms are provided. If datasets contain scraped content, the paper should describe steps taken to avoid releasing unsafe data.\n\n 12. Licenses\nEnsure that any external assets (code, data, models) are properly cited and that their licenses and terms of use are respected. The paper should state license names, provide citations, and include URLs where applicable. If data was scraped, its copyright status and terms of service should be acknowledged.\n\n 13. Assets\nIf the paper releases new datasets, models, or code, check whether they are well-documented. This includes providing structured templates detailing training procedures, licenses, and limitations. Assess whether consent was obtained for any human-derived data and whether anonymization was applied when necessary.\n\n 14. Crowdsourcing and Human Subjects Research\nFor research involving human subjects or crowdsourcing, verify that participant instructions, compensation details, and other relevant documentation are included (in the main text or supplement). Ensure compliance with ethical guidelines, including fair compensation for crowdsourced labor.\n\n",
  "template_field_semantics": {
    "summary": "Summary",
    "strengths": "Strengths",
    "weaknesses": "Weaknesses",
    "suggestions": "Questions"
  },
  "review_template": {
    "Summary": "Briefly summarize the paper and its contributions. This is not the place to critique the paper; the authors should generally agree with a well-written summary.",
    "Strengths": "Please provide a thorough assessment of the strengths of the paper, touching on each of the following dimensions:\na. Originality: Are the tasks or methods new? Is the work a novel combination of well-known techniques? (This can be valuable!) Is it clear how this work differs from previous contributions? Is related work adequately cited?\nb. Quality: Is the submission technically sound? Are claims well supported (e.g., by theoretical analysis or experimental results)? Are the methods used appropriate? Is this a complete piece of work or work in progress? Are the authors careful and honest about evaluating both the strengths and weaknesses of their work?\nc. Clarity: Is the submission clearly written? Is it well organized? (If not, please make constructive suggestions for improving its clarity.) Does it adequately inform the reader? (Note that a superbly written paper provides enough information for an expert reader to reproduce its results.)\nd. Significance: Are the results important? Are others (researchers or practitioners) likely to use the ideas or build on them? Does the submission address a difficult task in a better way than previous work? Does it advance the state of the art in a demonstrable way? Does it provide unique data, unique conclusions about existing data, or a unique theoretical or experimental approach?",
    "Weaknesses": "Please provide a thorough assessment of the weaknesses of the paper, touching on each of the following dimensions:\na. Originality: Are the tasks or methods new? Is the work a novel combination of well-known techniques? (This can be valuable!) Is it clear how this work differs from previous contributions? Is related work adequately cited?\nb. Quality: Is the submission technically sound? Are claims well supported (e.g., by theoretical analysis or experimental results)? Are the methods used appropriate? Is this a complete piece of work or work in progress? Are the authors careful and honest about evaluating both the strengths and weaknesses of their work?\nc. Clarity: Is the submission clearly written? Is it well organized? (If not, please make constructive suggestions for improving its clarity.) Does it adequately inform the reader? (Note that a superbly written paper provides enough information for an expert reader to reproduce its results.)\nd. Significance: Are the results important? Are others (researchers or practitioners) likely to use the ideas or build on them? Does the submission address a difficult task in a better way than previous work? Does it advance the state of the art in a demonstrable way? Does it provide unique data, unique conclusions about existing data, or a unique theoretical or experimental approach?",
    "Questions": "Please list up and carefully describe any questions and suggestions for the authors. Think of the things where a response from the author can change your opinion, clarify a confusion or address a limitation. This can be very important for a productive rebuttal and discussion phase with the authors.",
    "Limitations": "Have the authors adequately addressed the limitations and potential negative societal impact of their work? If not, please include constructive suggestions for improvement. In general, authors should be rewarded rather than punished for being up front about the limitations of their work and any potential negative societal impact. You are encouraged to think through whether any critical points are missing and provide these as feedback for the authors."
  },
  "overall_score_name": "Overall",
  "review_scores": {
    "Soundness": {
      "meaning": "Please assign the paper a numerical rating on the following scale to indicate the soundness of the technical claims, experimental and research methodology and on whether the central claims of the paper are adequately supported with evidence.",
      "scores": {
        "4": "excellent",
        "3": "good",
        "2": "fair",
        "1": "poor"
      }
    },
     "Presentation": {
      "meaning": "Please assign the paper a numerical rating on the following scale to indicate the quality of the presentation. This should take into account the writing style and clarity, as well as contextualization relative to prior work.",
      "scores": {
        "4": "excellent",
        "3": "good",
        "2": "fair",
        "1": "poor"
      }
    },
    "Contribution": {
      "meaning": "Please assign the paper a numerical rating on the following scale to indicate the quality of the overall contribution this paper makes to the research area being studied. Are the questions being asked important? Does the paper bring a significant originality of ideas and/or execution? Are the results valuable to share with the broader NeurIPS community.",
      "scores": {
        "4": "excellent",
        "3": "good",
        "2": "fair",
        "1": "poor"
      }
    },
    "Confidence": {
      "meaning": "Please provide a 'confidence score' for your assessment of this submission to indicate how confident you are in your evaluation.",
      "scores": {
        "5": "You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
        "4": "You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
        "3": "You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
        "2": "You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
        "1": "Your assessment is an educated guess. The submission is not in your area or the submission was difficult to understand. Math/other details were not carefully checked."
      }
    },
    "Overall": {
      "meaning": "Please provide an 'overall score' for this submission.",
      "scores": {
        "10": "Award quality: Technically flawless paper with groundbreaking impact on one or more areas of AI, with exceptionally strong evaluation, reproducibility, and resources, and no unaddressed ethical considerations.",
        "9": "Very Strong Accept: Technically flawless paper with groundbreaking impact on at least one area of AI and excellent impact on multiple areas of AI, with flawless evaluation, resources, and reproducibility, and no unaddressed ethical considerations.",
        "8": "Strong Accept: Technically strong paper with, with novel ideas, excellent impact on at least one area of AI or high-to-excellent impact on multiple areas of AI, with excellent evaluation, resources, and reproducibility, and no unaddressed ethical considerations.",
        "7": "Accept: Technically solid paper, with high impact on at least one sub-area of AI or moderate-to-high impact on more than one area of AI, with good-to-excellent evaluation, resources, reproducibility, and no unaddressed ethical considerations.",
        "6": "Weak Accept: Technically solid, moderate-to-high impact paper, with no major concerns with respect to evaluation, resources, reproducibility, ethical considerations.",
        "5": "Borderline accept: Technically solid paper where reasons to accept outweigh reasons to reject, e.g., limited evaluation. Please use sparingly.",
        "4": "Borderline reject: Technically solid paper where reasons to reject, e.g., limited evaluation, outweigh reasons to accept, e.g., good evaluation. Please use sparingly.",
        "3": "Reject: For instance, a paper with technical flaws, weak evaluation, inadequate reproducibility and incompletely addressed ethical considerations.",
        "2": "Strong Reject: For instance, a paper with major technical flaws, and/or poor evaluation, limited impact, poor reproducibility and mostly unaddressed ethical considerations.",
        "1": "Very Strong Reject: For instance, a paper with trivial results or unaddressed ethical considerations"
      }
    }
  }
}
